["im training a dataset with the 10,000 most viral linkedin posts and organizing them in a structure along with linkedin's algorithm to create a website that helps you write guaranteed hits on linkedin. \n\nwhos interested?","if there’s even one percent of u that wonders what it’s like\n\n> to have a college friend group\n> to meet a girl in class, spark a romance, and fall in love w each other\n> to go to frat parties and get piss drunk w ur friends\n> to go to sports events and cheer for ppl uve never","Imagine your entire company gets designated as the ‘untouchable’ caste.","\"Yeah\"","Average guys dating history:\n- High school girlfriend\n- Division 3 field hockey player\n- 7/10 marketing girlie from Hinge\n\nAverage girls dating history:\n- 42yo multimillionaire\n- Professional athlete\n- Fortune 500 executive\n- Grammy-nominated musician\n- Brain surgeon","one of the rarest traits in a collaborator: \n\nthe ability to give great feedback on work-in-progress\n\nmost people can only give feedback like the thing is already finished, aka their fidelity is wrong.","Using ice to remove excess oil from food","It’s never lips \nIt’s always hands\n\nIntimacy is in the hands\n\nThe heart quickening moments of my romantic life always came back to two hands","Who sees recommendations when AI assistants make choices for you? \n\nIf agents decide what you buy, watch, and experience, they become the audience for recommendations \n\nWe've mastered persuading humans, but AI-to-AI persuasion seems like uncharted territory \n\nHow will this work?","instead of using the past hour and a half to study for my mandarin quiz, i decided to build a tool to help me study instead! chat am i cooked?? using cloud vision api + \n@vercel\n \n@v0","13 year old me would think current me is so cool and hot and that’s really all that matters","as i get older, i’m starting to realize that the purest form of love is consideration. when someone thinks about how things would make you feel. holds you in regard when making decisions that could affect you. how much they care about you is found in how much they consider you","“just wanted to hear your voice” actually means a lot","The most bitter people you’ll ever meet are white-collar workers in their late 30s who took gifted classes in elementary school and AP classes in high school, got 3.8 GPAs in college, and now make $150-200k in corporate middle-management jobs after failing to develop the","It is likely that we only have ~3 years remaining where 95% of human labor is actually valuable (i.e. earns you money)\n\nMost people haven't realized this yet.\n\nIt is also likely that this will be the end of our current iteration of labor-based capitalism.","I made the bubble bar a package for SwiftUI. :]\n\nEnjoy! It's open source, so feel free to contribute. [Link Below]","What if you could see who’s leaving top companies?\n\nIntroducing http://trytalenthunt.com\n\n– Track talent movement from 50+ top companies\n– See the leaderboard of fastest growing teams in tech","Almost ready to launch my first iOS app!","For anyone worried about career growth, I have a white pill for you:\n\nCareer is very non-linear. I know someone who blew up multiple startups only to become an executive of one of the most important startups in the valley right now in just a year. \n\nAll it takes is one hit.","Hi! Some personal news~ \n\nI'm starting an independent design studio!! If you want to collaborate or hire me for any projects hit my line! \n\nLink and more in thread ","YC doubted our coding skills before we were accepted. Last week we just wrapped up W25.\n\nTruthfully, Ergo was powered by \n@zapier\n  during our first interview. The feedback: \"Reach out when you have a fully software-based version.\"\n\nFinals week at Georgia Tech turned into a coding","new app is cooking\n\nlooking to bring on a full time eng with design experience \n\nwill be hitting $100k MRR within the next few days on this one\n\ndm me","Email to Steve Wozniak:","Day 1 of building things no one wants: \n\nMix songs without a DJ board","brave take from a guy whose wife as worked as:\n- an IB analyst at Goldman Sachs\n- a partner at a16z\n- a software engineer at Coinbase\n- a founder of multiple companies, including cofounding a company with him\n\nwhile his linkedin looks like this:","Dunking on women for not being politically and historically educated is like dunking on children\n\nGirls aren't supposed to know or care about these things \n\nThey're girls. \n\nIf you are a super political chick, YOU are the weirdo x.com/kaitmarieox/st…","carl jung knew","i have noticed that when people want something too badly, when they chase, when they try too hard—it almost always slips away. it’s not just some dumb universe thing.. it’s just human nature. people can smell desperation, & it repels. not because they consciously think “oh, this","An unfortunate realization for a NYC boi living in LA: The SF founders are just better. \n\nGood pockets elsewhere (NYC for consumer/fintech, LA for games/defense). But the network effects of SF are very strong for tech\n\nHigher surface area for serendipity. Gotta move","If you're dating someone in India and haven’t talked about caste, family pressure or where you’ll settle, you’re not in love. You’re just in a phase. Most relationships don’t survive outside the vibe. Let’s talk about why","friend's boyfriend dumped her after 10+ years of relationship because he woke up one morning and realised that his parents won't agree for an inter-caste marriage while the friend has already fought at her home and convinced the family for the same, mardjaat is in shambles fr","I worked a lot on my mental health and now I am no longer ambitious.","this is the most important post i am writing in 2024\n\nfor 2025, all you need is a pocket notebook, pen and a watch. ive watched over 100+ productivity videos, read 10+ books on it, nothing works as easy as this. it’s called the practice of SOLILOQUY \n\na thread","I dropped out so I didnt get a graduation\n\nSo we’re hosting a graduation for only dropouts\n\nDetails below","The ability to say you’re going to do something and to believe that you’ll actually do it is a superpower.","the founder archetypes:\n\nthe artist: jobs, chesky\nthe engineer: musk, levchin, woz, luckey\nthe thinker: thiel, dorsey, (patrick) collison\nthe general: huang, rabois, bezos\n\nwhat archetypes am i missing?","youre not being fumbled, the market’s just not ready for you","Whenever my parents offer me advice, I can always trace the lesson back to their having grown up in a communist country, which is pretty remarkable, considering they left over fifty years ago.","This is how you vibe debug your LLM in the future","the girl to guy ratio is sf is…something","Vibe coding tip: if you run into an issue that takes a few iterations to fix, have your AI write a \"fixes\" doc in .md and include a full explanation of the issue and the fix.","ai made knowing what you don't know more important than knowing\n\nand everyone who understands this, companies or people, will have a huge advantage until the rest of the world forcefully wakes up","","Drop your testing stack","it’s time to change my life","Carl Jung out here diagnosing humanity like it’s a group project.","First 5 mins of UP. it’s so loving yet the most saddest ever.","I didn’t expect The Four Loves by C.S. Lewis to hit so hard.","Every rich dude ik is crazy. A true schizo. Conspiracies, spirituality, parallel realities. They eat it up. Our dads generation became successful by trusting in hard work and the system, these days the rebellious minds are winning","On an 14 hour flight I sat next to a college student who bought Wi-Fi to have Claude summarizes research papers into an essay which he then feeds into an “AI detection” website. He repeats this process with Claude over and over until the output clears the website’s detection.","Through my role with 20VC; I study investors for a living. \n\n\n@andrew__reed\n must be the best investor of the last 5-7 years. \n\nElevenLabs ($3.3BN) \n\nVanta ($2.45BN) \n\nFigma ($20BN) \n\nOdoo ($5BN) \n\nBolt ($8BN) \n\nKlarna ($15BN-$20BN)\n\nZapier ($5BN) \n\nCirca $65BN of EV. \n\nAverage","u have to shoot so many shots its ridiculous \n\nbusinesses ive done\n\n1: landscape biz ($5k\n2: 7 dropshipping stores ($15k)\n3: theme pages ($40k/mo)\n4: 3 failed info biz ($5k)\n5: agency ($110k/mo)\n6: Launch Socials ($150k/mo)\n7: clothing brand (next)\n\nKEEP GOING","Mfs been “locked in” for years but still have no output or any results\n\nA lot of these types need to “unlock” and go on a heroic bender. live a little bit, crash out, get a fresh perspective & re set.\n\nHermit mode, adderall, 0 social life for years… has diminishing returns.","really enjoyed playing piano  for the pre-show, 20x larger than any audience i’ve previously had","we booked a hockey arena to put on the most extra demo day ever!","INTRODUCING AURUM\n\naurum, aurī /ˈau̯.rum; objects made of gold; wealth, riches\n\nSwipe on what really matters.\n\nLaunching March 29th.","Someone needs to make a dating app with Plaid/Brokerage Account sync.","Either solve the problems of a few rich people or a lot of poor people. But don't get stuck in between trying to sell average products at average prices to average people. That's where businesses bleed and ambition goes to die.","moral dilemma tamagotchi game is out!\n\nanswer moral dilemmas, shape your pet's beliefs, and collect all 15 evolutions\n\n#gamedev","i built an app that turns any goals into courses and PODCASTS.\n\nugc marketing, building saas, becoming a chef..\n\neven vibe coding a flight simulator like \n@levelsio","man i am learning some stuff about the ADHD / depression network of symptoms / habits. life just gets harder if you don't immediately execute on all of your ideas. you have to remember and worry about remembering more stuff. executing constantly reduces memory load so much","the main thing i’m trying to do rn is make the gap between having the idea to do something and doing it as short as possible and so far the ideas i’m executing on mostly don’t involve reading or writing tweets. so it goes. headed to barnes and noble again to read a history book x.com/qiaochuyuan/st…","Dear designer...","The San Francisco Bay Area is just ridiculously gorgeous. I mean come on. All of this accessible by bike starting in Oakland.","Calorie tracking with Meta Raybans, open source","inversion is my favorite way of thinking. it applies to everything.\n\none example: most people think the only way know about startups is by building them—starting from scratch, making mistakes, iterating. that’s important as hell. but you could invert that too. work inside a big","my relationship w achievement is putting everything I haven't done on a pedestal and dismissing everything I have as no big deal\n\nThe attitude I had towards growing an audience + making reels + making money from substack + bootstrapping a year ago vs now lol","being able to ask any question i can think of with zero judgement has genuinely helped keep my childlike curiosity alive","\"how does nuclear fusion work? ... what do you mean fusion depends on quantum tunneling? ... how do people contain plasmas in other contexts? ... why? why? why?\"","Hour 95/100 learning motion\n\nIt's all in the details","If you have an hour to puddle around on social media or Netflix, you also have the time to do a workout or go for a walk.","manus is going to put a lot of people out of work,\n\ntravel agents, entry level stock analysts, insurance people, and more can all be automated by manus \n\n(and sometimes arguably better results)","Yes. Expect a bunch of no’s though.","lifes biggest secret is you can just ask people for stuff you want x.com/_sonith/status…","After 7 months, I finished my essay on high agency.\n\nSo I asked myself: \"What's the most high agency way of promoting it?\"\n\nLast night, I took over the iconic Times Square in New York for $0.\n\nHilarious story...","I've been waiting 10 years to make this.","I wish I'd had a kid at 22. A couple people around me did. Even at my good college. No one at Harvard did but Carnegie Mellon University was bad enough at everything but computer science that there were actual working class people there. Actual warm blooded mammals from actual","Try using image editing with \n@Grok\n!","just hit 700k on my apps instagram !!!!","genuinely can't believe this happened a week ago... eternally grateful","i wrote a new blog. i hope you all enjoy.","mention an agent","personal news: i recently joined the ai crew at meta to slide back into designing social products\n\nso far i've been mostly playing around with different models and vibe coding testflights - learning a ton!","I'm tired of feeling like I'm not doing anything in college\n\nStarting road to $25k by 2025\n\nWill post weekly updates","It's happening. April 19-20th in NYC.\n\nEveryone gets their own robot arms to keep.\n\nDM for early invites!","Buying a bunch of these and hosting a hackathon in NYC. I’ll supply 3D printers, soldering, sensors, motors, workshops, etc. Just show up and make cool robot arms.\n\nIf anyone wants to help make this great, dm me! @RemiCadene x.com/KrishRShah/sta…","The smartest, most talented people I know all grew up in Richmond Hill","Richmond hill is robust","The smartest move you'll ever make is walking away from the chaos you never should've entertained in the first place. Not every battle is yours. Not every mess is worth cleaning up. Protect your peace, and let fools play their own games.","average sf hinge experience","sf is peak tech, ny is peak design and toronto is peak in both tech, design and we're funnier","If your business isn't making $100,000 a month. \nFollow these 2 steps. \n1) Grab a kitchen timer & turn it to 4 hours.\n2) Advertise until the timer is up.\n\nYou can do warm outbound, cold outbound, content, or paid ads. Don’t do all of them. Just pick 1 until you get to $100k a","i suck at reading so i made an app that reveals words when you press [tab]\n\nhere's How to Do Great Work by \n@paulg\n:","Going to Symposium was my best decision of 2025 yet","tech bro discovers the Public Library","I’ve been thinking a lot about third spaces:\n\n- A public place where you can sit and read or work\n- No pressure to buy anything\n- Surrounded by books and quiet people\n- Sometimes it can have free events and talks\n\nHas anyone tried this?","Your ability to learn and produce is a million folds today as compared to what it used to be - \n@pmarca","Man literally locked himself in an apartment under 24/7 surveillance until he cracks $1M mrr \n\nIf you learned 10% of what he’s doing you’ll get to $10k mrr","10x - Learn Anything\n\nLive now","it took \n@cory\n *half a decade* from cold DMing me to being the first money wired into \n@interaction\n\n\ni had no twitter followers and was just a random high school fucker.\n\nabsolute \n@cory","pretty much every cracked early stage founder i've met has either alr done @zfellows or is part of the next batch.  \n\nseeing how impressive the ppl in the jan 2025 cohort with me were is a BIG reason why i grew the balls to do @InterviewCoder the way I did.","Waterloo \n@socraticainfo\n made me realize that we haven't really been doing enough. \n\nThrowing an intercollegiate demo on April 11th and bringing in the best VCs from the Bay, including Pear, Soma, and Afore. \n\nLet this be the first step towards making the midwest Socratica happen.","Doing a pass through my network to see if I can do some match making and its truly jaw dropping:\n\nEveryone is single. It's absurd. And they're all intelligent, look great and have amazing jobs. \n\nCatastrophic fertility collapse ...","If you can afford to, you should spend the time and money to go to China. \n\nGo to Beijing and then either Shenzhen or Chongqing. Plan and take two weeks to do it, go and come back via NYC or LA.\n\nYou will understand things much better.","Grew up broke with no father. Became a millionaire at 24. Retired my mom. Employed my brother. Put my wife in designer and daughter in a penthouse. There’s nothing you can tell me that will phase me. I’ve done everything I said I would and more.\n\nPraise God.","14 year old cold emails \n@Alfred_Lin\n - Partner at Sequoia","i want a bf","i want a bf x.com/katdegen/statu…","pretty much every cracked early stage founder i've met has either alr done \n@zfellows\n or is part of the next batch.  \n\nseeing how impressive the ppl in the jan 2025 cohort with me were is a BIG reason why i grew the balls to do \n@InterviewCoder\n the way I did.","bro ","Why is Roy Lee in the Social Network? ","One of the clearest signs that you’re working on the right thing is that it gets you out of your own head. You stop overthinking. There’s no anxiety about the future. There’s just energy in the present. There’s just flow. Lean into the things that get you out of your head.","i never realized how dumb the average person was until i started talking to intelligent people...\n\ni've always had a massive curiosity when it comes to topics like science, psychology & business\n\ni always felt like an outcast when trying to talk about these things with my","He deleted almost every app from his phone.\n\nThen he wrote 4 bestsellers in 9 years.\n\nCal Newport's controversial take: Your phone is making you mediocre.\n\nHis science-backed system for getting your brain back:","Competitor: *breaths*\n\n10k angel investor who hasn’t spoken to me in months: “How are we feeling about this”","True love \n\n1. She loved him more than anything else","Some personal news: I recently joined Cursor. Cursor is a small, ambitious team, and they’ve created my favorite AI systems.\n\nWe’re now building frontier RL models at scale in real-world coding environments. Excited for how good coding is going to be.","a new pattern I've noticed: many of the smartest 20-25 year olds with AI knowledge are dropping out of PhDs/quitting their job/starting a new thing\n\nif you're early career, belief in near term (5-10y) AGI seems to imply this is good strategy—a challenge for hiring managers!","Many men think they’re not getting girls coz of their financial status or even their looks, but I’m here to tell you it’s coz of how your mind works","The soul is oriented towards obsession: it wants to be possessed by something greater, consummated in a quest, absorbed into a vortex of devotion, and eaten by the feeling of passion. The soul wants to fall in love hard.\n“All addictions are a low level search for God.” —Carl Jung","If you're curious about what shapes your life look for what you have an oddly high tolerance for (what you lean into) and oddly low tolerance for (what you avoid or rule out) relative to other people","some marriages are bad, many marriages are pretty good, and a few marriages are palpably, radiantly excellent. I had the privilege of asking Todd and Elaine—who’ve been together since their freshman year of college, run a chocolate company together, and are both so lovely—about","Accenture's CEO is married to Chertoff Group's co-founder Chad Sweet.\n\nChertoff Group, founded by former Bush-era DHS secretary Michael Chertoff, is owned by Carlyle Group.\n\nReady for this one? Michael Chertoff is Senior Of Counsel at Covington & Burling LLP, who were just the","The most dangerous, oddly glorified, yet overlooked problem in the world:\n\nOverthinking and underacting.\n\nIt's why you're stressed, depressed and your immune system is always in chaos.\n\nHere's Eckhart Tolle 7-step protocol to escape the prison of overthinking: ","“If you do not trust life to unfold, the mind takes over and it becomes a game of strategy, motivated by anxiety. This mistrust is unfair. Life has given us so much, and yet we do not trust it.”\n— Mooji","this seems so common, you wanna do something but just assume that you can't and never question it. but bro acted","US cities tier list\n\nS: NYC, Miami\nA: Charleston, Savannah\nB: Seattle, San Diego, Austin, Dallas, Nashville\nC: Chicago, Boston, Vegas\nD: New Orleans\nF: LA, Portland, Charlotte","'4000 weeks' is by far the most insane framing for how short life is.","8. Get used to dealing with uncertainty \n\nI craved employment & one partner. So I ditched my girlfriend & changed careers.\n\nUncertainty is the path to growth. If you must know the outcome all the time, you're screwed.\n\nPredictable paths have the worst rewards.","I completely changed my life in 6 months (so can you). Here are the 18 things I did:","Just deleted Hinge. I will not go on another date until we achieve AGI\n\nThe only late-night grind in my foreseeable future will be of the professional variety","make it exist first! you can always make it look good later!","raising a pre-seed. round opens in 2 days. if i want u in, u’ll probably hear from me. \n\ni check dm’s","This guy literally drops a free masterclass on AI, robotics and computing. Can’t believe it’s free.","Above all, a nurturing peaceful spirit that regulates my nervous system after pursuing my mission for the day. A girl that can also switch between stimulating conversation and ridiculous inside jokes is a huge turn on too.","One thing I've learned is you'll never regret working with people who have high conviction in you as an individual. \n\nMaybe that's what we all should be optimizing for","in tech if you have bad GPA instead of army recruiting you join palantir as a forward deployed engineer","hey guys did you know 99% of \"aura\" is just fucking smiling \n\nmost people look like they wanna unalive themselves \n\njust radiate happiness by looking happy and inviting \n\nthat can replace 99% of the gey sht you guys say on here about aura and how to get it\n\nwhen you walk into a","I've spent my career on this, and one thing is clear: the best founders empower design. Not superficially or as decoration, but as a driving force for thinking, creation, and execution.\n\nDesign brings great companies to life.","After advising 50+ consumer companies over the last year, the one thing that separates those who can execute and those who can't:\n\nHaving a full-time designer in the room at all times\n\nI've met with countless companies that have raised millions—and even one that has raised","who’s the sf techbro and who’s the nyc model?\n\nlevel: impossible",">be me\n>lowly broke student, nobody important\n>meet great co-founder\n>move to sf for yc\n>going up against one of the largest conglomerates in the world (NVIDIA)\n>putting together super cracked team to win\n>actually designs something great\n>mfw","relatability is underrated (thread)\n\nno point in trying to sound smarter/better/more 10x than ppl\n\njust straightforward communication, being honest with losses, etc. can go a long way in my opinion","Proud of my boyfriend for stepping into this new chapter. Lucky to witness his journey firsthand. ","This is what I sent to my colleagues at OpenAI:\n\nHi all, I made the difficult decision to leave OpenAI as an employee, but I’m looking to work closely together as a partner going forward. Contributing to the mission of OpenAI and working with world-class teams to create and","One of the main reasons I didn't do the interview is cause I didn't want to disappoint my boss at Goldman Sachs who had taken a risk by hiring me.  \n\nThat boss ended up leaving my team just two months later.  \n\nSo any loyalty I felt to him was not rewarded for long.  Now I tell","I joined \n@ManusAI_HQ\n!  \n\nManus is one of the coolest products I’ve ever used. We just launched a closed beta and got more than 2 million people on the waitlist in 7 days.","Introducing Manus: the first general AI agent. \nTry Manus today and see the future of human-machine collaboration: https://manus.im","be patient","Reddit comment explains what's possible for the future of software engineering with Anthropic's MCP (model context protocol).\n\nA lot of people don't understand MCP hype but it's coming together as the API layer for LLMs to communicate to other products.\n\nHow AIs talk to software.","I’ll keep saying this until my last breath. Your mindset controls your future. Master it, or be mastered by it.","doge needs to shut this down fr","Perplexity got no chill and I love it\nhaven’t seen such a bold ad in a while\n\nI love the severance setup\n\nThis ad clearly urges users to stop using Google (not sure if anybody actually are)\n\nIt was not about “ask anything” it obviously shows that Googling something is outdated,","if you have built a product with 1000+ users, you will 100% get hired with a pay of 25-40k. that too without interviews or applying.","a short advice for cs students/people who want to take it:\n\n1. build useful/helpful projects around the topics that you are really interested in. building or improving something from ground up can teach you a lot of things that you may overlook otherwise.\n\n2. post about your","not too bad for some React \"webslop\" hmm?","note-taking software doesn't need to be bloated or slow! (yes this is actual 1x speed )","i hate product design and the vibes around it. vulture energy and usually no soul in the design. \n\nhalf of the product designers i see on here couldn't even draw a stick figure.","COLD EMAILS THAT GO HARD V1","One day, you’ll realise that the people who left you didn’t take anything with them. The love was yours. The kindness was yours. And those things still belong to you.","i wish more ppl understood the ability to change your mind as a sign of intelligence. you don’t have to keep believing the same things you believed 5, 10, 20 yrs ago. a flexible mind is an agile mind. standing on business doesn’t hit if the business is bullshit","I'm wearing skims I'm wearing uggs, I have my juicy bag, I've got my cute little 2016 puff, my shades are miu miu","i've never understood people who take shit personally. \n\nwho has the time to scheme ways to put people down? who has the energy to be passive aggressive\n\ninterpreting a gesture as pointed feels so unbelievably narcissistic, like who tf would be thinking about you that much LOL","Goals are for people who care about winning once. Systems are for people who care about winning repeatedly.","men crave romantic relationships more than women bc if they aren't involved with someone, no one remembers it's their birthday. no one texts them to follow up if they got that promotion. no one comes over with takeout on a hard day. \n\nmy female friends do all of these things.","The “minimum” in MVP is the minimum it takes to get someone to open their wallet, not the minimum it takes for the product to work","You have to protect what you're grateful for, or you'll lose it. Men & women both. No one else will do it for you. Your relationships, possessions, what you build with others - they're all vulnerable without care.\nMost of the time, this means protecting them from yourself - your","most people don't realize the impact of truly multimodal ai models that can generate more than just text\n\nthese are the real startup killers\n\ndon't believe me?\n\nall of the following tasks required a specific workflow so far, now gemini can do them all:","Relentlessly dedicated myself to maximizing agency and everything in life 10x’ed","Beginners are focused on what to do and I think the focus should be how much to do - Andrej Karpathy","same will not compete with notion\n\n...our users will","unfortunately your ability to move on is dependent on how high your self-esteem and self-respect is","I've heard you love building AI consumer apps.\n\nI spent 100hrs analyzing the viral organic strategies of \n\n14 AI mobile apps doing a combined $2,370,000 in MRR  (so you don't have to)","if you wanna learn how to code in 2025…\n\nyou can just ask claude to create a roadmap & then feed it to cursor to walk you through each part with practical exercises"]